TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/CycleJourneyPlannerSynchronous/V1/PlanCycleJourney - Coordinates 2.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
	<PlanCycleJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.CycleJourneyPlannerSynchronous.V1">
      <transactionId>testCycleJourneyPlanner</transactionId>
      <request>
        <JourneyRequest>
          <JourneyRequestId>01</JourneyRequestId>
          <OriginLocation>
            <Description>Origin Coordinate</Description>
			<Type>Coordinate</Type>
			<GridReference>
				<Easting>346600</Easting>
				<Northing>390402</Northing>
			</GridReference>
          </OriginLocation>
          <DestinationLocation>
            <Description>Destination Coordinate</Description>
			<Type>Coordinate</Type>
			<GridReference>
				<Easting>347800</Easting>
				<Northing>391702</Northing>
			</GridReference>
          </DestinationLocation>
          <OutwardDateTime>2014-04-18T09:00:00.0000+01:00</OutwardDateTime>
          <OutwardArriveBefore>false</OutwardArriveBefore>
        </JourneyRequest>
      </request>
    </PlanCycleJourney>
  </soap:Body>
</soap:Envelope>
